import React from "react";
import { useIsDesktop, useIsTablet } from "../hooks/mediaQuery";
import Topnavigate from "../components/navigation/topnavigate";
import Topmobilenavigate from "../components/navigation/topmobilenavigate";
import MetaTag from "../components/metaTag";
import Footer from "../components/footer";

import * as global from "../styles/base/global.module.scss";

function Agreement() {
  const isDesktop = useIsDesktop();
  const isTablet = useIsTablet();

  return (
    <>
      {isDesktop && <Topnavigate />}
      {isTablet && <Topmobilenavigate />}
      <section className={global.container}>
        <div className={global.policy}>
          <h3>Пользовательское Соглашение</h3>
          <p>
            Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует
            отношения между владельцем https://graphiksi.ru (далее Графикси |
            Онлайн практикум или Администрация) с одной стороны и пользователем
            сайта с другой.
            <br />
            Сайт Графикси | Онлайн практикум не является средством массовой
            информации.
          </p>

          <p>
            Используя сайт, Вы соглашаетесь с условиями данного соглашения.
            <br />
            Если Вы не согласны с условиями данного соглашения, не используйте
            сайт Графикси | Онлайн практикум!
          </p>

          <h6>Предмет соглашения</h6>
          <p>
            Администрация предоставляет пользователю право на размещение на
            сайте следующей информации:
          </p>

          <h6>Предмет соглашения</h6>
          <p>
            Администрация предоставляет пользователю право на размещение на
            сайте следующей информации:
            <br />- Ссылок на материалы, размещенные на других сайтах
          </p>

          <h6>Права и обязанности сторон</h6>
          <p>
            Пользователь имеет право:
            <br />
            - осуществлять поиск информации на сайте
            <br />
            - получать информацию на сайте
            <br />
            - создавать информацию для сайта
            <br />
            - копировать информацию на другие сайты с указанием источника
            <br />- использовать информацию сайта в личных некоммерческих целях
          </p>

          <h6>Администрация имеет право:</h6>
          <p>
            - по своему усмотрению и необходимости создавать, изменять, отменять
            правила
            <br />
            - ограничивать доступ к любой информации на сайте
            <br />
            - создавать, изменять, удалять информацию
            <br />
            - удалять учетные записи
            <br />- отказывать в регистрации без объяснения причин
          </p>

          <h6> Пользователь обязуется:</h6>
          <p>
            - не нарушать работоспособность сайта
            <br />
            - не создавать несколько учётных записей на Сайте, если фактически
            они принадлежат одному и тому же лицу
            <br />
            - не размещать материалы рекламного, эротического, порнографического
            или оскорбительного характера, а также иную информацию, размещение
            которой запрещено или противоречит нормам действующего
            законодательства РФ
            <br />- не использовать скрипты (программы) для автоматизированного
            сбора информации и/или взаимодействия с Сайтом и его Сервисами
          </p>

          <h6>Администрация обязуется:</h6>
          <p>
            - поддерживать работоспособность сайта за исключением случаев, когда
            это невозможно по независящим от Администрации причинам.
          </p>

          <h6>Ответственность сторон</h6>
          <p>
            - пользователь лично несет полную ответственность за
            распространяемую им информацию
            <br />
            - администрация не несет никакой ответственности за достоверность
            информации, скопированной из других источников
            <br />
            - администрация не несет никакой ответственности за услуги,
            предоставляемые третьими лицами
            <br />- в случае возникновения форс-мажорной ситуации (боевые
            действия, чрезвычайное положение, стихийное бедствие и т. д.)
            Администрация не гарантирует сохранность информации, размещённой
            Пользователем, а также бесперебойную работу информационного ресурса
          </p>

          <h6>Условия действия Соглашения</h6>
          <p>
            Данное Соглашение вступает в силу при регистрации на сайте.
            <br />
            Соглашение перестает действовать при появлении его новой версии.
            <br />
            Администрация оставляет за собой право в одностороннем порядке
            изменять данное соглашение по своему усмотрению.
            <br />
            Администрация не оповещает пользователей об изменении в Соглашении.
          </p>

          <br />
          <p>
            Соглашение разработано на базе юридических документов сервиса
            Правилль
          </p>
        </div>
      </section>
      <Footer />
    </>
  );
}

export const Head = () => {
  const title = "Пользовательское соглашение";
  const description =
    "Сервис, который помогает улучшить портфолио и получить консультации от экспертов на любом этапе твоей карьеры";

  const data = {
    title: `Графикси | ${title}`,
    description: description,
    slug: `/agreement`,
    preview: "/preview.png",
  };

  return <MetaTag data={data} themeColor="#f3eee1" />;
};

export default Agreement;
